{
	"99_names": [
	{
		"id":1,
		"name": "Ar-Rahman",
		"meaning": "The Beneficent",
		"explanation": "He who wills goodness and mercy for all His creatures.",
		"dua": "O Allah, Ar-Rahman, we know that Your mercy is perfect. Let us never despair of Your mercy, guide us to be merciful to others, to maintain our family ties, and to seek Your pleasure. Enable us to reflect on Your mercy around us, adorn us with gratefulness, and enter us into Paradise by Your mercy, ameen!"
	},
	{
		"id":2,
		"name": "Ar-Raheem",
		"meaning": "The Merciful",
		"explanation": "He who acts with extreme kindness.",
		"dua": "O Allah, Ar-Raheem, we know that You bestow Your mercy perfectly and continuously on all that exists. Guide us to hold onto Your book and the sunnah so we may attain your special mercy and adorn our actions, speech, and thoughts with a deep sense of taqwa. Make us turn to You at all times, asking for Your Mercy, and make us compassionate so we will enter through the gates of Your paradise by Your mercy, ameen!"
	},
	{
		"id":3,
		"name": "Al-Malik",
		"meaning": "The King",
		"explanation": "The Sovereign Lord, The One with the complete Dominion, the One Whose Dominion is clear from imperfection.",
		"dua": "O Allah, Al-Malik, we know that You are our only King and Owner. Help us in following Your commands and in being Your righteous slaves, and adorn us with patience and humility. Guide us in being just in all our daily affairs, and admit us to Your Kingdom of Paradise, ameen!"
	},
	{
		"id":4,
		"name": "Al-Quddus",
		"meaning": "The Most Sacred /The Most Holy",
		"explanation": "The one who is pure, so far removed of any imperfection. He has no shortcomings, evil is not attributed to Him.",
		"dua": "O Allah, Al-Quddus, we know that You are the absolutely pure beyond imagination. Lead us to a sound belief in Your oneness, help us in purifying our hearts, deeds, and intentions, and guide us to purify our bodies and keep our environment clean. Aid us in performing the best salah, giving the best charity, and helping us to turn to the Quran so we can come to You with a pure heart, ameen!"
	},
	{
		"id":5,
		"name": "As-Salaam",
		"meaning": "The Giver of Peace",
		"explanation": "The One who is free from every imperfection. It is because He is free of any defect that one who is with Him experiences tranquility.",
		"dua": "O Allah, As-Salaam, we know that all peace and safety comes from You alone. Keep us safe in this world and the next, guide us to patience and inner peace, and make us of those from whom others are safe and make us safe from the injustice of others. Adorn us with sound hearts and make us of those who receive Your salaam in Paradise, ameen!"
	},
	{
		"id":6,
		"name": "Al-Mu'min",
		"meaning": "The Infuser of Faith",
		"explanation": "The One who witnessed for Himself that no one is God but Him. And He witnessed for His believers that they are truthful in their belief that no one is God but Him.",
		"dua": "O Allah, Al-Mu'min, we know that You are the Source of Faith and Giver of safety. Bless us with strong emaan, lead us in taking care of our trusts and fulfilling our promises, and adorn us with all the characteristics of Your beloved believers. Grant us steadfastness and safety in this world and the Hereafter, and make us of those who enjoy the ultimate safety of Paradise, ameen!"
	},
	{
		"id":7,
		"name": "Al-Muhaymin",
		"meaning": "The Guardian",
		"explanation": "The One who witnesses the saying and deeds of His creatures.",
		"dua": "O Allah, Al-Muhaymin, we know that You are the One who ensures our well-being. Make us mindful of You in everything we do and aid us in accepting and being content with Your decree in good and bad times. Make the Quran our close companion and a witness for us, protect and cure our hearts from its diseases, and protect us at all times, against others and ourselves, in this life and in the Hereafter, ameen!"
	},
	{
		"id":8,
		"name": "Al-Aziz",
		"meaning": "The Mighty One",
		"explanation": "The Strong, The Defeater who is not defeated.",
		"dua": "O Allah, Al Aziz, we know that all might belongs to You. Adorn us with the honour of Islaam, protect us from misusing our powers, make us of those who rely upon Your power only, make us benefit from the Quran and protect us from all of those who want to overpower us, ameen!"
	},
	{
		"id":9,
		"name": "Al-Jabbar",
		"meaning": "The All Compelling",
		"explanation": "The One that nothing happens in His Dominion except that which He willed.",
		"dua": "O Allah, Al-Jabbar, we know that You are the One who compels and restores and who is Highest. Mend our hearts when we are distressed and protect us from oppression and from being oppressive to others. Make us obey Your commands willingly, and enable us to reach all our goals which are pleasing to You, ameen!"
	},
	{
		"id":10,
		"name": "Al-Mutakabbir",
		"meaning": "The Dominant One",
		"explanation": "The One who is clear from the attributes of the creatures and from resembling them.",
		"dua": "O Allah, Al-Mutakabbir, we know that You are supremely Great. Guide our hearts and actions to humility towards You, our Deen and Your creation. Protect us from arrogance and assist us to ways to cure any arrogance that entered our hearts. Make us of those who are blessed to witness Your Grandeur in Paradise, ameen!"
	},
	{
		"id":11,
		"name": "Al-Khaliq",
		"meaning": "The Creator",
		"explanation": "The One who brings everything from non-existence to existence.",
		"dua": "O Allah, Al-Khaliq, we know that You are the Creator of all that existed, exists, and will exist. Lead us to unshakable belief in you as our Creator and let us never ascribe partners to You. Guide us to please You and to ask You for our needs and wishes, awaken us to reflect on the creation, and make us of those who are good in form and good in manners, ameen!"
	},
	{
		"id":12,
		"name": "Al-Bari",
		"meaning": "The Evolver /The Maker",
		"explanation": "The Maker, The Creator who has the Power to turn the entities.",
		"dua": "O Allah, Al-Bari’,we know that You create and form from nothing. Make us confident in our belief in You as the Originator of everything and let us worship you alone; guide us to obey You, distance ourselves from bad, enjoin good, and forbid evil. Help us ponder Your creations and appreciate Your power and greatness and give thanks to You, and maks us of those who carry the da’wah of Your Oneness to others in the best way, ameen!"
	},
	{
		"id":13,
		"name": "Al-Musawwir",
		"meaning": "The Flawless Shaper",
		"explanation": "The One who forms His creatures in different pictures.",
		"dua": "O Allah, Al-Musawwir, we know that You are the One who forms the whole creation. Make us of the shaakireen (the grateful ones) for our own forms and the shapes around us, help us ponder Your creations and ask You at all times. Make us of those who use the blessings you gave us for good, and make us witness the beautiful shapes of Paradise, ameen!"
	},
	{
		"id":14,
		"name": "Al-Ghaffar",
		"meaning": "The Great Forgiver",
		"explanation": "The Forgiver, The One who forgives the sins of His slaves time and time again.",
		"dua": "O Allah, Al-Ghaffar, we know that You forgive, cover, and protect us continuously. Forgive our sins, the first one, the last one, the hidde,n and apparent, and enable us to keep turning to You seeking forgiveness. Conceal our shortcomings in this life and on the Day of Judgement, protect us from the effects of our sins, and aid us to be forgiving to others, ameen!"
	},
	{
		"id":15,
		"name": "Al-Qahhar",
		"meaning": "The All-Prevailing One",
		"explanation": "The Dominant, The One who has the perfect Power and is not unable over anything.",
		"dua": "O Allah, Al-Qahhar, we know that You overpower everything. Make us of those who bow to You in Islam, adorn us with apprehension of You, and aid us to surrender our hearts and our actions to You only. Make us ponder Your power, abandon our sins, and be kind to the weak, ameen!"
	}
  ],
	"hisnames": {
		"names": "99names"
	}
}
